app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(params[:school_class])
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hotdog 101"], ["room_number", 420], ["created_at", "2016-12-30 02:49:27.404315"], ["updated_at", "2016-12-30 02:49:27.404315"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params[:school_class])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-12-30 02:54:59.559366"], ["id", 1]]