app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-12-30 02:54:59.848906"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params[:student])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Donald"], ["last_name", "Duck"], ["created_at", "2016-12-30 02:45:29.058239"], ["updated_at", "2016-12-30 02:45:29.058239"]]
---
  def create
    @student = Student.new(params[:student])
    @student.save